{"keras_version": "1.2.0", "config": [{"config": {"subsample": [1, 1], "batch_input_shape": [null, 64, 96, 3], "nb_row": 1, "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "nb_filter": 1, "nb_col": 1, "activation": "linear", "bias": true, "init": "glorot_uniform", "name": "convolution2d_1", "b_constraint": null, "input_dtype": "float32", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"subsample": [1, 1], "nb_row": 3, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "b_regularizer": null, "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "nb_filter": 24, "nb_col": 3, "activation": "linear", "bias": true, "init": "glorot_uniform", "name": "convolution2d_2", "b_constraint": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_1", "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"subsample": [1, 1], "nb_row": 3, "W_regularizer": null, "b_regularizer": null, "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "nb_filter": 36, "nb_col": 3, "activation": "linear", "bias": true, "init": "glorot_uniform", "name": "convolution2d_3", "b_constraint": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_2", "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"subsample": [1, 1], "nb_row": 3, "W_regularizer": null, "b_regularizer": null, "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "nb_filter": 48, "nb_col": 3, "activation": "linear", "bias": true, "init": "glorot_uniform", "name": "convolution2d_4", "b_constraint": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_3", "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "input_dim": 2880, "W_constraint": null, "output_dim": 100, "activation": "linear", "bias": true, "init": "uniform", "name": "dense_1", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "input_dim": 100, "W_constraint": null, "output_dim": 100, "activation": "linear", "bias": true, "init": "uniform", "name": "dense_2", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "input_dim": 100, "W_constraint": null, "output_dim": 10, "activation": "linear", "bias": true, "init": "uniform", "name": "dense_3", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_6", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "input_dim": 10, "W_constraint": null, "output_dim": 1, "activation": "linear", "bias": true, "init": "glorot_uniform", "name": "dense_4", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}